linux/arch/laptop-mode.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>laptop-mode</title>
<!-- 2017-02-26 Sun 23:14 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">laptop-mode</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. laptop-mode</a>
<ul>
<li><a href="#sec-1-1">1.1. install</a></li>
<li><a href="#sec-1-2">1.2. startup laptop-mode</a></li>
<li><a href="#sec-1-3">1.3. setting</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1. set brightness</a></li>
<li><a href="#sec-1-3-2">1.3.2. set network</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> laptop-mode</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> install</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-shell">yaourt -Ss laptop-mode
yaourt -Syu laptop-mode-tools
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> startup laptop-mode</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">

<pre class="src src-shell">systemctl start laptop-mode
systemctl enable laptop-mode
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> setting</h3>
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> set brightness</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
editor /etc/laptop-mode/conf.d/lcd-brightness.conf
</p>
<div class="org-src-container">

<pre class="src src-bash">CONTROL_BRIGHTNESS=1

BATT_BRIGHTNESS_COMMAND="echo 100"
LM_AC_BRIGHTNESS_COMMAND="echo 100"
NOLM_AC_BRIGHTNESS_COMMAND="echo 100"
BRIGHTNESS_OUTPUT="/sys/class/backlight/intel_backlight/brightness"
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> set network</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
editor /etc/laptop-mode/conf.d/ethernet.conf
</p>
<div class="org-src-container">

<pre class="src src-bash">ETHERNET_DEVICES="enp0s25"  # set network device
</pre>
</div>

<p>
#+begin<sub>html</sub>
&lt;!&#x2013; 多说评论框 start &#x2013;&gt;
        &lt;div class="ds-thread" data-thread-key="11" data-title="laptop-mode" data-url="<a href="http://blog.flytrap.top/linux/arch/laptop-mode.html">http://blog.flytrap.top/linux/arch/laptop-mode.html</a>"&gt;&lt;/div&gt;
&lt;!&#x2013; 多说评论框 end &#x2013;&gt;
&lt;!&#x2013; 多说公共JS代码 start (一个网页只需插入一次) &#x2013;&gt;
&lt;script type="text/javascript"&gt;
var duoshuoQuery = {short<sub>name</sub>:"flytrap"};
        (function() {
                var ds = document.createElement('script');
                ds.type = 'text/javascript';ds.async = true;
                ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
                ds.charset = 'UTF-8';
                (document.getElementsByTagName('head')<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup> 
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left">document.getElementsByTagName('body')<sup><a id="fnr.1.100" name="fnr.1.100" class="footref" href="#fn.1">1</a></sup>).appendChild(ds);</td>
</tr>
</tbody>
</table>
<p>
        })();
        &lt;/script&gt;
&lt;!&#x2013; 多说公共JS代码 end &#x2013;&gt;
#+end<sub>src</sub>
</p>
</div>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p>DEFINITION NOT FOUND.</p></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="date">Created: 2017-02-26 Sun 23:14</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
